
# .1 벡터와 화살표 p123
# 벡터란 방향과 크기로 결정되는 양을 말한다.

# .2 벡터의 성분 p124
# 화살표는 어디에나 그릴 수 있으나 화살표만으로 모든 것을 설명할 수는 없다.
# 벡터의 성분 구하기
# 벡터의 시작점 A의 좌표(x1, y1)와 끝점 B의 좌표(x2, y2)를 사용해 다음과 같은 방식으로 구할 수 있습니다.
# 벡터 AB = (x2 - x1, y2 - y1)
# 예
# 점 A = (4, 2)
# 점 B = (6, 5)
# 벡터 AB = (6-4, 5-2) = (2, 3)

# .3 벡터의 방향 126
import math

# 126 벡터의 방향 구하기
def ex127(x, y):
    rad = math.atan2(y, x)  # 각도를 구한다
    th = math.degrees(rad)  # 도수법으로 변환한다
    print(th)

# .4 벡터의 크기 128
# 129 단위 벡터
# 단위 벡터 : 벡터AB와 방향이 같고, 크기가 1인 벡터
# 벡터의 크기 : 스칼라. 벡터가 아닌 숫자 값

# .5 벡터의 연산 129
# 덧셈
# 벡터 a + b = c
# a의 끝점에 b의 시작점을 가져다 붙인다.
# a의 시작점에서 시작해서 b의 끝점을 가리키는 벡터가 c
# a + b = b + a가 됨. 교환법칙 성립함
# 두 벡터 시작점이 동일한 위치에 있으면 두 벡터의 평행사변형의 대각선 = a + b가 됨

# 뺄셈